data.github_repository.repo: Reading...
data.github_repository.repo: Read complete after 0s [id=web-template]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_issue_label.labels["area:backend"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "0052cc"
      + description = "Backend (server, API)"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "area:backend"
      + repository  = "web-template"
      + url         = (known after apply)
    }

  # github_issue_label.labels["area:shared"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6a737d"
      + description = "Shared libraries/components"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "area:shared"
      + repository  = "web-template"
      + url         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Commentterraform-plan -->